In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("data/international-airline-passengers.csvx", engine="python", skipfooter=3)

In [3]:
df.columns

Index([u'Month', u'International airline passengers: monthly totals in thousands. Jan 49 ? Dec 60'], dtype='object')

In [4]:
df.columns = ["months", "passengers"]

In [5]:
df["passengers"] == df.passengers

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
20     True
21     True
22     True
23     True
24     True
25     True
26     True
27     True
28     True
29     True
       ...
114    True
115    True
116    True
117    True
118    True
119    True
120    True
121    True
122    True
123    True
124    True
125    True
126    True
127    True
128    True
129    True
130    True
131    True
132    True
133    True
134    True
135    True
136    True
137    True
138    True
139    True
140    True
141    True
142    True
143    True
Name: passengers, Length: 144, dtype: bool

In [6]:
df['ones'] = 1
df.head()

    months  passengers  ones
0  1949-01         112     1
1  1949-02         118     1
2  1949-03         132     1
3  1949-04         129     1
4  1949-05         121     1

In [7]:
df["x1x2"] = df.apply(lambda row: row['passengers'] + row['ones'], axis=1)
df.head()

    months  passengers  ones  x1x2
0  1949-01         112     1   113
1  1949-02         118     1   119
2  1949-03         132     1   133
3  1949-04         129     1   130
4  1949-05         121     1   122

In [8]:
def get_sqrt(row):
    return np.sqrt(row['x1x2'])

df['sqrt-x1x2'] = df.apply(get_sqrt, axis=1)
df.head()

    months  passengers  ones  x1x2  sqrt-x1x2
0  1949-01         112     1   113  10.630146
1  1949-02         118     1   119  10.908712
2  1949-03         132     1   133  11.532563
3  1949-04         129     1   130  11.401754
4  1949-05         121     1   122  11.045361

In [11]:
from datetime import datetime
datetime.strptime("1949-05", "%Y-%m")

datetime.datetime(1949, 5, 1, 0, 0)

In [14]:
df["dt"] = df.apply(lambda row: datetime.strptime(row.months, "%Y-%m"), axis=1)
df.head()

    months  passengers  ones  x1x2  sqrt-x1x2         dt
0  1949-01         112     1   113  10.630146 1949-01-01
1  1949-02         118     1   119  10.908712 1949-02-01
2  1949-03         132     1   133  11.532563 1949-03-01
3  1949-04         129     1   130  11.401754 1949-04-01
4  1949-05         121     1   122  11.045361 1949-05-01

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 6 columns):
months        144 non-null object
passengers    144 non-null int64
ones          144 non-null int64
x1x2          144 non-null int64
sqrt-x1x2     144 non-null float64
dt            144 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(3), object(1)
memory usage: 6.8+ KB